test_text = "გამარჯობა. მე თქვენი ასისტენტი ვარ, რით შემიძლია გემსახუროთ?"

poem_texts = [
    
"""
ხამს მიჯნური ხანიერი, არ მეძავი, ბილწი, მრუში,
რა მოჰშორდეს მოყვარესა, გაამრავლოს სულთქმა, უში,
გული ერთსა დააჯეროს, კუშტი მიჰხვდეს, თუნდა ქუში.
მძულს უგულო სიყვარული, ხვევნა, კოცნა, მტლაში-მტლუში.
მას ცოცხალი ნუ ელევის, რაცა პირველ შეუყვარდეს,
ნუცა ლხინსა აუზვავდეს, ნუცა ჭირსა შეუზარდეს.
მისთვის დათმოს ყველაკაი, მისთვის ველთა გამოვარდეს,
ნურა გაჰვა, სოფელიცა მისი კერძი გარდაქარდეს
ამა საქმესა მიჯნური ნუ უხმობს მიჯნურობასა.
დღეს ერთი უნდეს, ხვალე სხვა, სთმობდეს გაყრისა თმობასა.
ესე მღერასა ბედითსა ჰგავს, ვაჟთა ყმაწვილობასა.
კარგი მიჯნური იგია, ვინ იქმს სოფლისა თმობასა.
""",
"""
რომელმან შექმნა სამყარო ძალითა მით ძლიერითა,
ზეგარდმოთ არსნი სულითა ყვნა ზეცით მონაბერითა,
ჩვენ, კაცთა, მოგვცა ქვეყანა, გვაქვს უთვალავი ფერითა,
მისგან არს ყოვლი ხელმწიფე სახითა მის მიერითა.
ჰე, ღმერთო ერთო, შენ შეჰქმენ სახე ყოვლისა ტანისა,
შენ დამიფარე, ძლევა მეც დათრგუნვად მე სატანისა,
მომეც მიჯნურთა სურვილი, სიკვდიდმდე გასატანისა,
ცოდვათა შესუბუქება, მუნ თანა წასატანისა.
ვის ჰშვენის, ლომსა, ხმარება შუბისა, ფარ-შიმშერისა,
მეფისა მზის - თამარისა, ღაწვ-ბადახშ, თმა-გიშერისა,
მას, არვიცი, შევჰკადრო შესხმა ხოტბისა, შე - რისა,
მისთა მჭვრეტელთა ყანდისა მირთმა ხამს მიმართ, შერისა.
""",
"""
მიჯნურობა არის ტურფა, საცოდნელად ძნელი გვარი. 
მიჯნურობა სხვა რამეა, არ სიძვისა დასადარი.იგი სხვაა, 
სიძვა სხვაა, შუა უზის დიდი ზღვარი,
ნურვინ გარევთ ერთმანეთსა! 
გესმის ჩემი ნაუბარი?"
"""
]